import React from 'react';

const Avengers = () => {
    return (
        <div>
            <h2>Мстители (фильм, 2012)</h2>
            <p>«Мсти́тели» (англ. The Avengers[комм 1]) — американский художественный фильм о супергероях с элементами комедии режиссёра Джосса Уидона, основанный на одноимённых комиксах издательства Marvel Comics. Картина является шестым по счёту в кинематографической вселенной Marvel, а также общим сиквелом предществующих экранизаций: «Железный человек» (2008), «Невероятный Халк» (2008), «Железный человек 2» (2010), «Тор» (2011) и «Первый мститель» (2011). Кинопрокат осуществляла компания Walt Disney Pictures[комм 2][2], а в качестве актёров были привлечены исполнители ролей соответствующих персонажей в предыдущих фильмах киновселенной: Роберт Дауни-младший, Крис Эванс, Крис Хемсворт, Скарлетт Йоханссон, Джереми Реннер, Том Хиддлстон, Сэмюэль Л. Джексон и другие. Сыгравший Брюса Баннера (Халка) Марк Руффало, в отличие от своих коллег, исполнял роль своего персонажа впервые. По сюжету Ник Фьюри, глава организации Щ.И.Т., объединяет супергероев Железного человека, Халка, Тора, Капитана Америку, Чёрную вдову и Соколиного глаза для спасения мира от его захвата богом Локи. Фильм не является адаптацией какого-либо сюжета комиксов, однако создатели вдохновлялись и черпали различные элементы из серии The Ultimates[3] и комиксов о первой инкарнации команды Мстителей[4].</p>
        </div>
    );
};

export default Avengers;