import React from 'react';

const History = () => {
    return (
        <p>В апреле 2004 года НАСА начало отбор предложений по оснащению нового марсохода научным оборудованием, и 14 декабря 2004 года было принято решение об отборе восьми предложений. В конце того же года началась разработка и испытания составных частей системы, включая разработку однокомпонентного двигателя производства компании Aerojet, который способен выдавать тягу в диапазоне от 15 до 100 % от максимальной при постоянном давлении наддува.

        Создание всех компонентов марсохода завершилось к ноябрю 2008 года, причём большая часть приборов и программного обеспечения MSL продолжало испытываться. Перерасход бюджета миссии составил около 400 миллионов долларов. В следующем месяце НАСА отложило запуск MSL на конец 2011 года из-за недостатка времени для испытаний.
        
        С 23 по 29 марта 2009 года на сайте НАСА проводилось голосование по выбору названия для марсохода, на выбор было дано 9 слов[20]. 27 мая 2009 года победителем было объявлено слово «Кьюриосити» которое предложила шестиклассница из Канзаса Клара Ма[21][22].
        
        Марсоход был запущен ракетой «Атлас-5» с мыса Канаверал 26 ноября 2011 года. 11 января 2012 года проведён специальный манёвр, который эксперты называют «самым важным» для марсохода. В результате совершённого манёвра аппарат взял курс, который привёл его в оптимальную точку для десантирования на поверхность Марса.
        
        28 июля 2012 года проведена четвёртая небольшая коррекция траектории, двигатели включили всего на шесть секунд. Операция прошла настолько успешно, что финальная коррекция, изначально намеченная на 3 августа, не потребовалась[23].
        
        Посадка прошла успешно 6 августа 2012 года, в 05:17 UTC[24]. Радиосигнал, сообщающий об успешной посадке марсохода на поверхность Марса, достиг Земли в 05:32 UTC[25].</p>
    );
};

export default History;